{
  "intents": [
    {
      "intent_id": "functional.priority_blend",
      "description": "Clarify the blend of capabilities the program must train (general conditioning, hybrid strength-cardio, functional athleticism) to set session emphasis.",
      "experience_modifiers": {
        "beginner": "Frame outcomes in accessible language (feeling fitter, keeping up with life demands).",
        "intermediate": "Encourage awareness of balance between strength, conditioning, and skill.",
        "advanced": "Surface competitive or benchmark-driven targets (e.g., CrossFit Open, gym testing)."
      },
      "applicability_conditions": [
        "Always relevant for functional or general conditioning goals.",
        "Use when goal language mixes strength and cardio aims."
      ],
      "tags": ["priority_focus", "hybrid"]
    },
    {
      "intent_id": "functional.movement_quality",
      "description": "Understand which movement quality or mobility gaps the plan should address so exercises build usable range and stability.",
      "experience_modifiers": {
        "beginner": "Ask about everyday movements that feel stiff or limited.",
        "intermediate": "Tie movement focus to recurring tightness or fatigue in specific patterns.",
        "advanced": "Explore high-skill positions that require mobility stability (overhead, deep squats, gymnastics)."
      },
      "applicability_conditions": [
        "Prioritize when the goal references holistic fitness, resilience, or reducing aches.",
        "Include when past injuries or mobility limits are mentioned."
      ],
      "tags": ["mobility", "movement_focus"]
    },
    {
      "intent_id": "functional.energy_systems",
      "description": "Identify conditioning styles that must feature in programming (HIIT, circuits, steady state) to deliver the desired adaptations.",
      "experience_modifiers": {
        "beginner": "Discuss enjoyable cardio formats or class types.",
        "intermediate": "Balance varied conditioning intensities to avoid burnout.",
        "advanced": "Dial into energy system emphasis for competitive functional fitness demands."
      },
      "applicability_conditions": [
        "Use when goal mentions metabolic conditioning, classes, or time-efficient workouts.",
        "Optional if goal is strictly strength without cardio elements."
      ],
      "tags": ["conditioning_style", "cardio_support"]
    },
    {
      "intent_id": "functional.equipment_flexibility",
      "description": "Capture available tools and environments (kettlebells, sleds, classes, outdoor spaces) so every prescribed session is feasible.",
      "applicability_conditions": [
        "Always relevant—functional training often depends on diverse equipment options.",
        "Include travel or class access patterns if mentioned."
      ],
      "tags": ["equipment_access", "environment"]
    },
    {
      "intent_id": "functional.lifestyle_alignment",
      "description": "Understand lifestyle drivers (session length, stress relief, class cadence) that the plan must respect when setting frequency and session structure.",
      "experience_modifiers": {
        "beginner": "Discuss schedule realities and preferred session length.",
        "intermediate": "Explore weekly rhythms balancing work, family, and training.",
        "advanced": "Link training cadence to competitive seasons or peak periods."
      },
      "applicability_conditions": [
        "Include when the goal references busy schedule, needing accountability, or holistic wellness.",
        "Optional if detailed scheduling info already captured elsewhere."
      ],
      "tags": ["lifestyle", "schedule_context"]
    }
  ]
}

