{
  "intents": [
    {
      "intent_id": "sport.phase_priority",
      "description": "Clarify the current season phase so the plan dials training content for build, maintenance, or transition needs.",
      "experience_modifiers": {
        "beginner": "Explain phases in simple terms (pre-season vs competition period).",
        "intermediate": "Tie priorities to upcoming team calendar milestones.",
        "advanced": "Surface nuanced transition points requiring load management."
      },
      "applicability_conditions": [
        "Always relevant for organized sport participation.",
        "Optional if the goal is recreational without a season structure."
      ],
      "tags": ["season_context", "priority_focus"]
    },
    {
      "intent_id": "sport.role_demands",
      "description": "Identify position or role demands to target the physical qualities practices and games actually require.",
      "experience_modifiers": {
        "beginner": "Use broad descriptions (needs more speed, needs more endurance).",
        "intermediate": "Encourage specifics tied to in-game responsibilities.",
        "advanced": "Highlight precise qualities (first-step explosiveness, repeat sprint ability)."
      },
      "applicability_conditions": [
        "Prioritize when the athlete references competitive play or specific positions.",
        "Optional for generalized sport fitness."
      ],
      "tags": ["role_specific", "strength_power", "endurance_speed"]
    },
    {
      "intent_id": "sport.practice_load",
      "description": "Capture practice and competition load patterns so session frequency and intensity align with existing schedule stress.",
      "experience_modifiers": {
        "beginner": "Ask about typical weekly practice frequency.",
        "intermediate": "Discuss variability in load (intense vs light weeks).",
        "advanced": "Quantify load using session counts, durations, or RPE when appropriate."
      },
      "applicability_conditions": [
        "Essential when the athlete has regular practices, games, or matches.",
        "Skip if training is independent of formal schedules."
      ],
      "tags": ["schedule_context", "load_management"]
    },
    {
      "intent_id": "sport.skill_support",
      "description": "Understand sport-specific movement skills the plan must reinforce (cutting, jumping, grappling) through targeted drills and conditioning.",
      "experience_modifiers": {
        "beginner": "Keep terms broad and focus on everyday sport actions.",
        "intermediate": "Tie skills to weaknesses noted by the athlete or coach.",
        "advanced": "Explore specialized skill demands that influence supplemental training."
      },
      "applicability_conditions": [
        "Use when athlete cites skill limitations or technical focus areas.",
        "Optional if the goal centers purely on conditioning or physique."
      ],
      "tags": ["movement_focus", "skill_transfer"]
    },
    {
      "intent_id": "sport.external_constraints",
      "description": "Document external constraints (travel cadence, tournament density, facility access) so the plan schedules realistic training windows.",
      "experience_modifiers": {
        "beginner": "Highlight simple constraints like school schedule or travel.",
        "intermediate": "Note repeating patterns (weekend tournaments, nightly practices).",
        "advanced": "Capture detailed logistics impacting recovery windows."
      },
      "applicability_conditions": [
        "Include when availability or logistics are mentioned.",
        "Always check if athlete competes in leagues with dense schedules."
      ],
      "tags": ["environment", "availability"]
    }
  ]
}
